#Дано натуральне ціле додатнє число n. Визначити кількість цифр в ньому.
# Вхідні дані:
# 12367832
# 142
# 0

n=int(input("введіть число:\n"))
if n > 0:
    # Перетворення числа на рядок
    n_str = str(n)
    n_list=list(n_str)
    print(len(n_list))  
else: 
       print('число не додатнє число')


